#+TITLE: Oppgaver
* Oppgaver
** $ og .
*** 1

#+begin_src haskell
map show $ reverse $ map (\x -> negate $ x + 1) [1,2,3]
#+end_src

#+RESULTS:
| -4 | -3 | -2 |

*** 2
#+begin_src haskell
f x = map show $ reverse $ map (\x -> negate $ x + 1) x
f [3, 2, 1]
#+end_src

#+RESULTS:
| -2 | -3 | -4 |

** Pattern matching
*** 1
#+begin_src haskell
f (0:_) = 0
f (_:1:_) = 1
f _ = 5
[f [0,1,2], f [5,1,2], f [5,5,2]]
#+end_src

#+RESULTS:
: Prelude> Prelude> [5,5,5]

Set multiline mode
#+begin_src haskell
:set +m
#+end_src

#+begin_src haskell
let f 1 = 1
    f _ = 2 in
  [f 1, f 2]
#+end_src

#+RESULTS:
: Prelude| Prelude| [1,2]
